<?php


/**                                       ЗАДАНИЕ:
 *                 Создать простую проверку дня(консольное приложение которое печатает
 *              информацию о текущем дне.
 *
 * 1.создать переменную с идентификатором дня.
 * 2.За все дни с понедельника по пятницу приложение должно распечатать сообщение с название дня.
 * 3.Для всех остальных дней приложение должно распечатать сообщение о выходных.
 */
//-------------------------------------------------------------------------------------------------


$idDay = date('w');
switch ($idDay) {
    case 1:
        echo 'Сегодня Понедельник.';
        break;
    case 2:
        echo 'Сегодня Вторник.';
        break;
    case 3:
        echo 'Сегодня Среда.';
        break;
    case 4:
        echo 'Сегодня Четверг.';
        break;
    case 5:
        echo 'Сегодня Пятница.';
        break;
    default:
        echo 'УРА, ВЫХОДНЫЕ.';
}















































