<?php

/**                                        ЗАДАНИЕ:
 *
 * 1. предоставить интерфейс для получения минимального и максимального значений диапазона
 * 2. найти все четные числа из указанного интервала
 * 3. напечатать основанные числа, разделенные запятыми
 */


echo " Создаём массив с последовательностью чисел от 1 до 50 .";
echo '<br>';
$numbers = range(1, 50);
echo " отображаем его максимальное число:";
echo '<br>';
echo max($numbers);
echo '<br>';
echo '<br>';
echo " отображаем его минимальное число:";
echo '<br>';
echo min($numbers);
echo '<br>';
echo '<br>';
echo " находим все четные числа из указанного интервала, записываем их в массив и разделяем запятыми.";
echo '<br>';
$array = [];
for ($i = min($numbers); $i <= max($numbers); $i++) {
    if ($i % 2 == 0) {
        array_push($array, $i);
    }
}
echo implode(', ', $array);




























