<?php

/**                                               ЗАДАНИЕ:
 *                           математические операции с различными типами данных:
 * 1. Целое число + строка чисел.
 * 2. Строка без чисел + целое число.
 * 3. Строка без номеров + Строка без номеров.
 * 4. Float + Integer.
 * 5. сравнить сумму плавающих чисел с ожидаемым результатом (для примера 1.3 + 0.1 == 1.4).
 */

$a = 41;
echo '$a = 41';
echo '<br>-----------------------------------------------------------------------';
echo '<br>';
echo '1. Integer "$a" + String "18" = ';
var_dump($a + "18");
echo '<br>';
echo '2. String "Test String" + Integer "$a" = ';
var_dump('Test String' + "$a");
echo '<br>';
echo '3. String "Test String" + String "Test" = ';
var_dump('Test String' + 'Test');
echo '<br>';
echo '4. Float "12.48" + Integer "10" = ';
var_dump('12.48' + '10');
echo '<br>------------------------------------------------------------------------';
echo '<br>';
echo 'Сравнение чисел с плавающей запятой:';
echo '<br>';
echo '<br>';
echo 'Float "1.3" + Float "0.1" = ';
var_dump(1.3 + 0.1);
echo '<br>';
echo 'СТРАННО,НО: (Float "1.3" + Float "0.1 == Float "1.4" : ';
var_dump((1.3 + 0.1) == 1.4);