<?php

/**                                  ЗАДАНИЕ:
 *                   Создать рекурсивный факториальный калькулятор.
 * 1.создать рекурсивную функцию CalculateFactorial для вычисления факториала некоторого числа.
 * 2.вызвать функцию и распечатать результат работы на экране.
 *
 * Факториа́л — функция, определённая на множестве неотрицательных целых чисел.
 * Факториал натурального числа n определяется как произведение всех натуральных чисел от 1 до n включительно.
 */

/**
 * @param $x
 * @return float|int|string
 */
function CalculateFactorial($x) {
    if($x < 0) {
        return 'Ошибка: отрицательное число';
    }
    elseif ($x == 0) {
        return 1;
    } else
    {
        return $x * CalculateFactorial($x - 1);
    }
}

echo  CalculateFactorial(5);























