<?php

/**                                         ЗАДАНИЕ:
 *                             предоставить следующие текстовые строки:
 *
 * 1. Простая строка в одинарных кавычках с переменной.
 * 2. Строка в одинарных кавычках с экранирующими символами.
 * 3. Простая строка в двойных кавычках с переменной.
 * 4. Строка в двойных кавычках с escape-последовательностями.
 * 5. Строка с синтаксисом HereDoc / NowDoc
 */

$a = 'TEST';

echo '$a = \'TEST\'';
echo '<br>';
echo '<br>';
echo 'Простая строка в одинарных кавычках с переменной: $a';
echo '<br>';
echo 'Строка в одинарных кавычках с экранирующими символами со значением переменной \'' . $a . '\'';
echo '<br>';
echo "Простая строка в двойных кавычках со значением переменной: $a";
echo '<br>';
echo "Строка в двойных кавычках с escape-последовательностями:\$a= $a";
echo '<br>';
echo '<br>';
echo 'Строка с синтаксисом HereDoc / NowDoc.';
echo '<br>';
echo '<br>';
echo <<<HEREDOC
синтаксис HereDoc со значением переменной: "{$a}"
HEREDOC;
echo '<br>';
echo <<<'NOWDOC'
синтаксис NowDoc с переменной: "{$a}"
NOWDOC;


