<?php

/**                                    ЗАДАНИЕ:
 *                              Создать хранилище данных
 * 1. скопировать файл data.php из лаборатории 1.4.1.2
 * 2. добавить в каждый массив данных ученика ключи «языки» с пустыми массивами.
 * 3. создать новый массив со списком языков программирования
 * 4. добавить в каждый массив уроков некоторое количество языков программирования.
 * 5. добавить в строку вывода данных студента список разрешенных уроков по
 *     программированию (для создания строки из массива студент должен использовать функцию «выгрузить»)
 */



$peopleStudents = [
    'Гарик' => [
        'Имя' => 'Игорь Петров',
        'Возраст' => 22,
        'Пол' => 'мужской',
        'Языки' => []
    ],
    'Копчённый' => [
        'Имя' => 'Вадим Енотов',
        'Возраст' => 90,
        'Пол' => 'мужской',
        'Языки' => []
    ],
    'Мармышка' => [
        'Имя' => 'Светлана Лесова',
        'Возраст' => 25,
        'Пол' => 'женский',
        'Языки' => []
    ]
];


$languages = [
    'PHP',
    'C',
    'PYTHON',
    'JS',
    'Java',
    'C++',
    'C#'
];

$peopleStudents['Гарик']['Языки'] = [$languages[0], $languages[1]];
$peopleStudents['Копчённый']['Языки'] = [$languages[2], $languages[4], $languages[6]];
$peopleStudents['Мармышка']['Языки'] = [$languages[5], $languages[3]];



echo '<br>';
function idNik($nik) {
    global $peopleStudents;
    if (array_key_exists($nik, $peopleStudents)) {
        $dataPeople = ($peopleStudents[$nik]);
        $lang = implode(', ', ($peopleStudents[$nik]['Языки']));
        echo "Имя: {$dataPeople['Имя']}
        <br>Возраст: {$dataPeople['Возраст']}
        <br>Пол: {$dataPeople['Пол']}
        <br> Языки: $lang";
    } else {
        echo 'ОШИБКА,такого студента не существует';
    }
}

idNik('Копчённый');



































