<?php

/**                                           ЗАДАНИЕ:
 *           -Получить практический опыт использования функций массива с обратными вызовами
 *         -Студент должен создать консольное приложение с демонстрацией использования простого массива
            функции с обратными вызовами
 * 1. создать массив с последовательностью чисел от 1 до 100 и перемешать это
 * 2. отфильтровать значения массива и выбрать только те значения, которые больше 25 и менее 32
 * 3. распечатать полученный массив
 * 4. построить каждое значение отфильтрованного массива во второй степени
 * 5. снова напечатать полученный массив
 *
 * --программа должна использовать две разные функции массива для требуемых операций
• программа должна распечатать все данные с простым оформлением (заголовки и новые
линии)
 */

echo " Создаём массив с последовательностью чисел от 1 до 100 и мешаем его. ";
echo '<br>';
echo " Отфильтровывем значения массива и выбираем которые больше 25 и менее 32 : ";
$numbers = range(1, 100);
$array = shuffle($numbers);

function old($number) {
return ($number > 25 && $number < 32);
}
echo '<br>';
$age = (array_filter($numbers, "old"));
print_r($age);
echo '<br>';
echo '<br>';
echo " вычисляем каждое значение отфильтрованного массива во второй степени и отображаем его : ";
echo '<br>';
foreach($age as &$number) {
     $number = $number * $number;
}
print_r($age);
echo '<br>';
echo '<br>';
echo " метод с помощью функции изменять значения массива : ";
echo '<br>';
function ageCritical(&$number) {
    return $number = $number * $number;
}
(array_walk($age, 'ageCritical') );
print_r($age);














































