<?php

/**                                            ЗАДАНИЕ:
 *
 * 1. создать массив с уже созданными ключами (md5 хэши любого количества (4-6) чисел от 100 до 110).
 * 2. создать скрипт, который будет генерировать уникальный (не существующий в массиве с подготовленными ключами) ключ.
 *   Ключ должен по хешу md5 числовой последовательности от 100 до 110.
 * 3. распечатать каждый сгенерированный ключ (даже существующий)
 */

echo "<b>Хэш числа 100 : </b>" . md5(100);
echo '<br>';
echo "<b>Хэш числа 101 : </b>" . md5(101);
echo '<br>';
echo "<b>Хэш числа 102 : </b>" . md5(102);
echo '<br>';
echo "<b>Хэш числа 103 : </b>" . md5(103);
echo '<br>';
echo "<b>Хэш числа 104 : </b>" . md5(104);
echo '<br>';
echo "<b>Хэш числа 105 : </b>" . md5(105);
echo '<br>';
echo '<br>';
echo " <b>Создаём массив c этими хешами .</b>";
echo '<br>';

$key = [
    'f899139df5e1059396431415e770c6dd',
    '38b3eff8baf56627478ec76a704e9b52',
    'ec8956637a99787bd197eacd77acce5e',
    '6974ce5ac660610b44d9b9fed0ff9548',
    'c9e1074f5b3f9fc8ea15d152add07294',
    '65b9eea6e1cc6bb9f0cd2a47751a186f'
];
print_r($key);
echo '<br>';
echo '<br>';
echo " <b>Скрипт,кот.генерирует случайный хеш числа в диапазоне от 100 до 110 .</b>";
echo '<br>';
$randomNumber = mt_rand(100, 110);
$randomNumberHash = md5($randomNumber);
echo sprintf('[%d] => %s', $randomNumber, $randomNumberHash);
echo '<br>';
echo '<br>';
echo " <b> Печатаем случайное хеш число от 100 до 110.</b>";
echo '<br>';
echo " <b> Печататься будут случайные числа до тех пор,пока они присутствуют в массиве.</b>";
echo '<br>';
echo " <b> Если нет,скрипт распечатает хеш число единожды.</b>";
echo '<br>';
do {
    $keys = mt_rand(100, 110);
    $hash = md5($keys);

    echo sprintf('[%d] => %s', $keys, $hash);
} while (true === in_array($hash, $key));

// sprintf - задаём формат вывода %d = число,%s = строка.























