<?php

/**                                             ЗАДАНИЕ:
 * 1.  создать несколько параметров в предопределенной переменной $ _GET.
 * 2.  вывести данные из суперглобальных переменных:
 *                     $ _SERVER
 *                     $ _GET
 */



echo 'СУПЕРГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ';
echo '<br>';
echo '<br>';
$_GET['test'];
$_GET['data'] = '0123';
echo '<br>';
echo '$_GET: ';
var_dump($_GET);
echo '<br>-----------------------------------------------------------------';
echo '<br>';
echo '$_SERVER: ';
var_dump($_SERVER);