<?php

/**                                           ЗАДАНИЕ:
 *
 * 1. создать ассоциативный массив, где ключ - это псевдоним студента,
 * а значение - массив со следующими полями:
                   -Name
                   -Age
                   -Gender
 * 2.создать функцию для поиска данных студента по псевдониму
 * 3.принять ник из входных параметров и передать его в функцию
 * 4.Если псевдоним студента существует в массиве студентов,
 *  он должен напечатать каждый столбец массива на новой строке
 * 5.Если псевдоним студента не существует в массиве студентов, студент должен напечатать сообщение об ошибке
 */


$peopleStudents = [
    'Гарик' => [
        'Имя' => 'Игорь Петров',
        'Возраст' => 22,
        'Пол' => 'мужской'
    ],
    'Копчённый' => [
        'Имя' => 'Вадим Енотов',
        'Возраст' => 90,
        'Пол' => 'мужской'
    ],
    'Мармышка' => [
        'Имя' => 'Светлана Лесова',
        'Возраст' => 25,
        'Пол' => 'женский'
    ]
];


echo '<br>';
function idNik($nik) {
    global $peopleStudents;
    if (array_key_exists($nik, $peopleStudents)) {
        $dataPeople = ($peopleStudents[$nik]);
        echo "Имя: {$dataPeople['Имя']}<br>Возраст: {$dataPeople['Возраст']}<br>Пол: {$dataPeople['Пол']}";
    } else {
        echo 'ОШИБКА,такого студента не существует';
    }
}

idNik('Копчённый');






















