<?php

/**                                       ЗАДАНИЕ:
 *                         Создать простой текстовый вывод.
 * 1.создать переменную с содержимым границы (строка ‘----------------’ и т. Д.)
 * 2.создать функцию drawDelimiter с доступом к глобальной переменной с разделителем.
 *      Эта функция должна рисовать разделитель.
 * 3.создать переменную с некоторой строкой содержимого.
 * 4.создать и сохранить в переменную анонимную функцию $drawContentString с доступом
 *     к переменной с содержимым (студент должен использовать замыкание для доступа к переменной).
 *     Эта функция должна рисовать строку содержимого.
 * 5.Студент должен вызывать созданные функции в следующем порядке:
 *               drawDelimiter
 *               drawContentString
 *               drawDelimiter
 */


$symbol = '--------------------------------------';
function drawDelimiter() {
    global $symbol;
    echo $symbol;
    echo '<br>';
}


$string = 'Всё должно работать тип топ!!!';
$drawContentString = function () use ($string) {
    echo $string;
    echo '<br>';
};

drawDelimiter();
$drawContentString();
drawDelimiter();










