<?php

/**                                            ЗАДАНИЕ:
 *                                      СОЗДАТЬ ФИЛЬТР СОТРУДНИКОВ:
 *
 * 1. скопировать файл data.php из подготовительного каталога (здесь подготовлен массив сотрудников).
 * 2. создать приложение для поиска сотрудников с некоторыми специальными навыками в массиве сотрудников
 *     и распечатать данные сотрудников.
 * 3. Созданная заявка должна принимать следующие условия:
            - Если у сотрудника нет необходимых навыков, приложение должно остановить работу текущего сотрудника
 *  и перейти к следующему сотруднику в списке.
            - Если у сотрудника есть необходимые навыки, приложение должно распечатать информацию
 *  о найденном сотруднике и прекратить проверку следующих сотрудников.
 */

$employees = [
    [
        'name' => 'Clark Kent',
        'age' => 22,
        'skills' => ['PHP', 'Java', 'C#']
    ],
    [
        'name' => 'Steve Stifler',
        'age' => 21,
        'skills' => ['PHP', 'JS', 'CSS', 'HTML']
    ],
    [
        'name' => 'Bruce Wayne',
        'age' => 35,
        'skills' => ['PHP', 'PHP Unit', 'XDebug', 'JS']
    ],
    [
        'name' => 'Peter Parker',
        'age' => 18,
        'skills' => ['PHP', 'C', 'Pascal']
    ]
];
// для каждого значения($employee) массива $employees
foreach ($employees as $employee) {
    //если проверяемое значение(' PHP ') в массиве  $employee['skills'] = false, тоесть не
    // найдено или значение ('PHP Unit') то переходим к дальнейшим скилам и ищем там пока не найдём
    if (false === in_array('PHP', $employee['skills']) || false === in_array('JS', $employee['skills'])) {
        continue ;
    }
// выводим Имя /возраст в скобках/ и разделённые запятыми скиллы
    echo "{$employee['name']} ({$employee['age']} years): " . implode(', ', $employee['skills']);
    break;
}

