<?php

  /**                            ЗАДАНИЕ:
   * создать консольное приложение, которое должно генерировать строку с номером
   * и слово в правильном количестве(простой форматировщик строки).
   * -------------------------------------------------------------------------------------------------
   * 1.сгенерировать случайное число и объединить число с некоторым словом.
   * 2.Создать правильный суффикс слова и объединить его в строку Лабораторная работа.
   * 3.выходная строка должна иметь формат как «2 огурца на столе» или «1 огурец на столе.
   * 4.должно считаться исключением из числа 11.
   */

$number = mt_rand(0, 100);
if ($number >= 5 && $number < 21 || $number == 0 ) {
    $suffix = "$number огурцов";
}
elseif ($number % 10 == 1 || $number == 1) {
    $suffix = "$number огурец";
}
elseif ($number % 10 > 1 & $number % 10 < 5) {
    $suffix = "$number огурца";
} else {
    $suffix = "$number огурцов";
}
echo " На столе лежит $suffix.";




























