<?php

/**                                    ЗАДАНИЕ:
 *
 * 1. создать массив с последовательностью чисел и перемешать его
 * 2. распечатать результирующий массив, первый и последний элементы, количество элементов в массиве
 * 3. объединить все элементы массива через разделитель (например, запятую) и вывести результат
 * 4. создать переменную с некоторой строкой (например, Lorem ipsum)
 * 5. разбить строку на пробелы  и распечатать полученный массив
 * 6. создать два массива по-разному:
            Массив Первый должен быть создан с помощью функции array_push
            Второй массив должен быть создан классическим способом
 * 7. распечатать два созданных массива
 * 8. объединить два созданных массива и распечатать полученный массив
 */

//range --  Создать массив, содержащий диапазон элементов
$numbers = range(1, 15);
echo '<br>';
//shuffle — Перемешивает массив
 $x = shuffle($numbers);
 echo " Массив чисел от 1 до 15 перемешанный: ";
   foreach ($numbers as $number) {
       echo "$number" . ', ';
}
echo '<br>';
echo '<br>';
echo"Первый эллемент массива: " . $numbers[0];
echo '<br>';
echo '<br>';
echo"Последний эллемент массива: " . end($numbers);
echo '<br>';
echo '<br>';
echo "Переменная с некоторой строкой  " . '$str = ';
$str = "\"Допустим здесь некоторая строка\"";
echo $str;
echo '<br>';
echo '<br>';
echo "Разбиваем строку на пробелы и печатаем массив : ";
print_r (explode(' ', $str));
echo '<br>';
echo '<br>';
echo "array_push — Добавляет один или несколько элементов в конец массива";
echo '<br>';
echo "Создание массива с помощью функции array_push : ";
$arr1 = [];
array_push($arr1, 1, 2, 3, 4);
array_push($arr1, 6);
print_r($arr1);
echo '<br>';
echo '<br>';
echo "Создание массива обычным методом : ";
$arr2 = ['A', 'B', 'C', 'D'];
print_r(($arr2));
echo '<br>';
echo '<br>';
echo "Соединяем массивы  : ";
$arr3 = array_merge($arr2, $arr1);
print_r($arr3);





















































